In [25]:
import pandas as pd

data = {
    "id": [1, 2, 3, 4],
    "salary": [100, 200, 200, 300]
}

employee = pd.DataFrame(data)

employee

   id  salary
0   1     100
1   2     200
2   3     200
3   4     300

In [26]:
employee = employee.drop_duplicates(subset=["salary"])

employee

   id  salary
0   1     100
1   2     200
3   4     300

In [27]:
employee = employee.sort_values(by=["salary"], ascending=False)

employee

   id  salary
3   4     300
1   2     200
0   1     100

In [28]:
employee = employee.reset_index(drop=True)

employee

   id  salary
0   4     300
1   2     200
2   1     100

In [33]:
employee.shape

(3, 2)

In [39]:
employee.loc[[1], ["salary"]]

   salary
1     200

In [48]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    employee = employee.drop_duplicates(subset=["salary"])
    employee = employee.sort_values(by=["salary"], ascending=False).reset_index(drop=True)

    if employee.shape[0] < 2:
        return pd.DataFrame({"SecondHighestSalary": [None]})
    
    return pd.DataFrame({"SecondHighestSalary": [employee.loc[1, "salary"]]})

second_highest_salary(employee)

   SecondHighestSalary
0                  200